In [1]:
import pandas as pd

In [2]:
# Let us just create a dictioinary to understand about the DataFrame.

people = {
    "First": ["Me", "Myself", "I"],
    "Last" : ["He", 'She', "It"],
    "Email" : ["mehe@email.com", "myselfshe@email.com", "iit@email.com"]
}


# In this dict We can visualise the keys as the column's descripton and the values as the data of those column , then we can visualise that each row of values is meant for a single person in this case. We can Make this dict be represented as rows and columns by using Pandas.

In [3]:
df_example1 = pd.DataFrame(people)

In [4]:
df_example1

    First Last                Email
0      Me   He       mehe@email.com
1  Myself  She  myselfshe@email.com
2       I   It        iit@email.com

In [5]:
# First look at adding columns, we will simply create a column and simply pass the series of values we want that column to have.
# For eg we wanna combine our first and last name.
df_example1['First'] + ' ' +df_example1['Last']

0         Me He
1    Myself She
2          I It
dtype: object

In [6]:
# to add this to new column we can simply do this.
df_example1['full_name'] =  df_example1['First'] + ' ' +df_example1['Last']

In [7]:
# We are simply using strings here but you can also use apply() method here .
# We can't use dot notation to assign values
# If we use . notation on this then python will think you are trying to assign an attribute on a dataframe object.
df_example1

    First Last                Email   full_name
0      Me   He       mehe@email.com       Me He
1  Myself  She  myselfshe@email.com  Myself She
2       I   It        iit@email.com        I It

In [8]:
# Now removing columns.
# Suppose we dont wanna have first and last column. we will use drop method.
# Like we have seen before this will just give use a view of our data frame , to implement this we have to assign it to the data by setting inplace = true
df_example1.drop(columns = ['First', 'Last'], inplace = True)

In [9]:
df_example1

                 Email   full_name
0       mehe@email.com       Me He
1  myselfshe@email.com  Myself She
2        iit@email.com        I It

In [10]:
# Now suppose you wanna split that full name into first and last name . so we will use the split method, We will get first and last name in a list.
df_example1['full_name'].str.split(' ')

0         [Me, He]
1    [Myself, She]
2          [I, It]
Name: full_name, dtype: object

In [11]:
# Now if we wanna assign these to 2 different columns then we have to expand this list, so to do this here
# we can use the expand argument.
# Now we will have to set these 2 columns to our dataframe.
df_example1['full_name'].str.split(' ', expand = True)

        0    1
0      Me   He
1  Myself  She
2       I   It

In [12]:
# As we have learnt earlier to get multiple columns in square brackets we can pass a list for that.
df_example1[['first', 'last']] = df_example1['full_name'].str.split(' ', expand = True)

In [13]:
df_example1

                 Email   full_name   first last
0       mehe@email.com       Me He      Me   He
1  myselfshe@email.com  Myself She  Myself  She
2        iit@email.com        I It       I   It

In [14]:
# Now we will look to adding rows.
# We will also look how to append 2 dataframes into 1 bye appending their rows.

In [15]:
# Adding a single row using append

# df_example1.append({'first':'tony'})
# This will throw TypeError: Can only append a Series if ignore_index=True or if the Series has a name
# So lets just ignore the index and let pandas to add the row

In [16]:
df_example1.append({'first':'Tony'}, ignore_index = True)
# We can see the new name is append , but we only assigned first name and others are missing, so you can pass entire series.

                 Email   full_name   first last
0       mehe@email.com       Me He      Me   He
1  myselfshe@email.com  Myself She  Myself  She
2        iit@email.com        I It       I   It
3                  NaN         NaN    Tony  NaN

In [17]:
 # Now we will create a new data frame just to add this data frame to our previous dataframe
people = {
    "first": ["Tony", "Steve"],
    "last" : ["Stark", 'Rogers'],
    "Email" : ["IronMan@avenge.com", "Cap@avenge.com"]
}
df_example2 = pd.DataFrame(people)

In [18]:
df_example2
# But these have conflicting indexes and also their columns mismatches. So we will ignore_index.

   first    last               Email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [19]:
df_example1.append(df_example2, ignore_index = True)

                 Email   full_name   first    last
0       mehe@email.com       Me He      Me      He
1  myselfshe@email.com  Myself She  Myself     She
2        iit@email.com        I It       I      It
3   IronMan@avenge.com         NaN    Tony   Stark
4       Cap@avenge.com         NaN   Steve  Rogers

In [20]:
df_example1 = df_example1.append(df_example2, ignore_index = True)
# This append method doesnt have inplace attribute so we have to assign our dataframe like this here .

In [21]:
# So now if we wanna remove Cap Roger so we will use drop here too but insted of passing column name will will use index.
df_example1.drop(index = 4)

                 Email   full_name   first   last
0       mehe@email.com       Me He      Me     He
1  myselfshe@email.com  Myself She  Myself    She
2        iit@email.com        I It       I     It
3   IronMan@avenge.com         NaN    Tony  Stark

In [22]:
# So you wanna do some complicated like dropping the rows using conditionals , so we are gonna use loc or drop.
# This will remove the row having last name It.
# This .index will turn this condition into the index
df_example1.drop(index = df_example1[df_example1['last'] == 'It'].index)

                 Email   full_name   first    last
0       mehe@email.com       Me He      Me      He
1  myselfshe@email.com  Myself She  Myself     She
3   IronMan@avenge.com         NaN    Tony   Stark
4       Cap@avenge.com         NaN   Steve  Rogers